Revit 2027 API
PartMakerMethodToDivideVolumes.AreElementsValidIntersectingReferences(ICollection<ElementId>) Method
 Identifies if provided members are valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreElementsValidIntersectingReferences(
	ICollection<ElementId> elementIds
)
Public Function AreElementsValidIntersectingReferences (
	elementIds As ICollection(Of ElementId)
) As Boolean
public:
bool AreElementsValidIntersectingReferences(
	ICollection<ElementId^>^ elementIds
)
member AreElementsValidIntersectingReferences :
        elementIds : ICollection<ElementId> -> bool
Parameters
elementIds ICollection<ElementId>
 Element ids to be tested for validity for intersecting references.
Return Value
Boolean
 True if all references are valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
AreElementsValidIntersectingReferences Overload
Autodesk.Revit.DB Namespace